import random

poetrys = ["相寻梦里路，飞雨落花中。 ——晏几道《临江仙》", "画堂人静雨蒙蒙，屏山半掩余香袅。 ——寇准《踏莎行·春暮》", "细雨湿衣看不见，闲花落地听无声。 ——唐.刘长卿《别严士元》", "滴空阶、寒更雨歇，葬花天气。 ——清.纳兰性德《金缕曲.亡妇忌日有感》", "山中何事？松花酿酒，春水煎茶。 ——元.张可久《人月圆.山中书事》", "秋阴不散霜飞晚，留得枯荷听雨声。 ——李商隐《宿骆氏亭寄怀崔雍崔衮》", "寒鸦飞数点，流水绕孤村。 ——杨广《野望》", "一往情深深几许？深山夕照深秋雨。 ——纳兰容若《蝶恋花·出塞》", "杏花疏影里，吹笛到天明。 ——陈与义《临江仙》", "秋风生渭水，落叶满长安。 ——贾岛《忆江上吴处士》", "流波将月去，潮水带星来。 ——杨广《春江花月夜》", "春水碧于天，画船听雨眠。 ——韦庄《菩萨蛮》", "寂寞空庭春欲晚，梨花满地不开门。 ——刘方平《春怨》", "细雨梦回鸡塞远，小楼吹彻玉笙寒。 ——李璟《摊破浣溪沙》", "落花人独立，微雨燕双飞。 ——晏几道《临江仙》", "疏影横斜水清浅，暗香浮动月黄昏。 ——林逋《山园小梅》", "燕子来时新社，梨花落后清明。 ——晏殊《破阵子·春景》", "泪眼问花花不语，乱红飞过秋千去。 ——《蝶恋花》", "梧桐叶上三更雨，叶叶声声是别离。 ——周紫芝《鹧鸪天》", "蝉噪林逾静，鸟鸣山更幽。 ——王籍《入若耶溪》", "雁声远过潇湘去，十二楼中月自明。 ——温庭筠《瑶瑟怨》", "鸡声茅店月，人迹板桥霜。 ——温庭筠《商山早行》", "落絮无声春堕泪，行云有影月含羞。 ——吴文英《浣溪沙》", "空山松子落，幽人应未眠。 ——韦应物《秋夜怀丘员外》", "林下漏月光，疏疏如残雪。 ——张岱《金山夜戏》", "浮生只合尊前老，雪满长安道。 ——舒亶《虞美人·寄公度》", "风鸣两岸叶，月照一孤舟。 ——孟浩然《宿桐庐江寄广陵旧游》", "过雨看松色，随山到水源。 ——刘长卿《寻南溪常山道人隐居》", "时有落花至，远随流水香。 ——刘昚虚《阙题》", "红楼隔雨相望冷，珠箔飘灯独自归。 ——李商隐《春雨》", "估客昼眠知浪静，舟人夜语觉潮生。 ——卢纶《晚次鄂州》", "松月生夜凉，风泉满清听。 ——孟浩然《宿业师山房期丁大不至》", "海燕未来人斗草，江梅已过柳生绵。黄昏疏雨湿秋千。 ——李清照《浣溪沙》", "思君令人老，岁月忽已晚。 ——《行行重行行》", "同心而离居，忧伤以终老。 ——《涉江采芙蓉》", "断雨残云无意绪，寂寞朝朝暮暮。 ——毛滂《惜分飞》", "万顷波光摇月碎，一天风露藕花香。 ——黄庚《临平泊舟》", "马蹄踏水乱明霞，醉袖迎风受落花。 ——刘因《山家》", "绿池芳草满晴波，春色都从雨里过。 ——高启《春暮西园》", "月黑见渔灯，孤光一点萤。微微风簇浪，散作满河星。 ——查慎行《舟夜书所见》", "年年陌上生秋草，日日楼中到夕阳。 ——晏几道《鹧鸪天》", "把酒送春春不语。黄昏却下潇潇雨。 ——朱淑真《蝶恋花》", "斜阳外，寒鸦万点，流水绕孤村。 ——秦观《满庭芳》", "纷纷坠叶飘香砌。夜寂静，寒声碎。 ——范仲淹《御街行·秋日怀旧》", "何处合成愁，离人心上秋。 ——吴文英《唐多令》", "飘零疏酒盏，离别宽衣带。 ——秦观《千秋岁》", "拍手笑沙鸥，一身都是愁。 ——辛弃疾《菩萨蛮》", "风前横笛斜吹雨，醉里簪花倒著冠。 ——黄庭坚《鹧鸪天·座中有眉山隐客史应之和前韵即席答之》", "叶上初阳干宿雨，水面清圆，一一风荷举。 ——周邦彦《苏幕遮》", "秀樾横塘十里香，水花晚色静年芳。 ——蔡松年《鹧鸪天·赏荷》", "枕上诗书闲处好，门前风景雨来佳。 ——李清照《摊破浣溪沙》", "山际见来烟，竹中窥落日。 ——吴均《山中杂诗》"]

def reply_private_msg(msg):
    if msg:
        return random.choice(poetrys)
    return None

def reply_group_msg(msg):
    if msg:
        return random.choice(poetrys)
    return None